/* DOM api 1~6 문제풀이

[1번문제]
1. 요구사항 확인하기
 : 로딩될 때 해당 텍스트의 글씨(내용) 변경하기

2. 요구사항 바탕으로 인풋 생각하기
 (1) p태그 글씨
 (2) 변경되어 나타날 글씨

3. 인풋 바탕으로 단계별 한글로 함수 설계하기
 (1) p태그를 DOM 요소 받을 변수를 만든다
 (2) 로딩되었을 때 나타날 변경된 글씨를 담을 변수를 만든다
 (3) 로딩시 변경된 글씨를 보여주는 함수를 짠다

4. 단계별 구글링 키워드 생각하기
 (1) 자바스크립트 로딩할때 글자 변경하는 법
 (2) 자바스크립트 텍스트 변경


[2번문제]
1. 요구사항 확인하기
 : 탭을 클릭하면 해당 탭의 배경과 글자색 변경하기

2. 요구사항 바탕으로 인풋 생각하기
 (1) HTML의 탭 태그
 (2) 사용자가 클릭한 탭
 (3) 사용자가 클릭하면 변경될 탭의 배경 색
 (4) 사용자가 클릭하면 변경될 탭의 글씨 색

3. 인풋 바탕으로 단계별 한글로 함수 설계하기
 (1) 

4. 단계별 구글링 키워드 생각하기


[3번문제]
1. 요구사항 확인하기


2. 요구사항 바탕으로 인풋 생각하기


3. 인풋 바탕으로 단계별 한글로 함수 설계하기


4. 단계별 구글링 키워드 생각하기
*/
